ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/inc/MDR32FxQI_dma.h
/**
  ******************************************************************************
  * @file    MDR32FxQI_dma.h
  * @author  Milandr Application Team
  * @version V2.0.0i
  * @date    10/03/2022
  * @brief   This file contains all the functions prototypes for the DMA
  *          firmware library.
  ******************************************************************************
  * <br><br>
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, MILANDR SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT
  * OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2022 Milandr</center></h2>
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MDR32FxQI_DMA_H
#define __MDR32FxQI_DMA_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "MDR32FxQI_config.h"

/** @addtogroup __MDR32FxQI_StdPeriph_Driver MDR32FxQI Standard Peripherial Driver
  * @{
  */

/** @addtogroup DMA DMA
  * @{
  */

/** @addtogroup DMA_Exported_Types DMA Exported Types
  * @{
  */

/** @addtogroup DMA_channels_number DMA channels number
  * @{
  */

#define IS_DMA_CHANNELS(NUMBER) (((NUMBER) >= 1) && ((NUMBER) <= 32))

/** @} */ /* End of group DMA_channels_number */

/**
  * @brief DMA alternate data usage
  */
typedef enum
{
    DMA_ALternateDataDisabled = ((uint16_t)(0x00)),
    DMA_ALternateDataEnabled  = ((uint16_t)(0x01))
} DMA_Alt_Data_Usage;

#define IS_DMA_ALTERNATE_DATA(STATE)  (((STATE) == DMA_ALternateDataDisabled) || \
                                       ((STATE)  == DMA_ALternateDataEnabled))

/**
  * @brief DMA valid channels
  */
typedef enum
{
#if defined (USE_MDR32F9Q2I)
    DMA_Channel_UART1_TX = ((uint8_t)(0)),
    DMA_Channel_UART1_RX = ((uint8_t)(1)),
    DMA_Channel_UART2_TX = ((uint8_t)(2)),
    DMA_Channel_UART2_RX = ((uint8_t)(3)),
    DMA_Channel_SSP1_TX  = ((uint8_t)(4)),
    DMA_Channel_SSP1_RX  = ((uint8_t)(5)),
    DMA_Channel_SSP2_TX  = ((uint8_t)(6)),
    DMA_Channel_SSP2_RX  = ((uint8_t)(7)),
    DMA_Channel_ADC1     = ((uint8_t)(8)),
    DMA_Channel_ADC2     = ((uint8_t)(9)),
    DMA_Channel_TIM1     = ((uint8_t)(10)),
    DMA_Channel_TIM2     = ((uint8_t)(11)),
    DMA_Channel_TIM3     = ((uint8_t)(12)),
    DMA_Channel_SW1      = ((uint8_t)(13)),
    DMA_Channel_SW2      = ((uint8_t)(14)),
    DMA_Channel_SW3      = ((uint8_t)(15)),
    DMA_Channel_SW4      = ((uint8_t)(16)),
    DMA_Channel_SW5      = ((uint8_t)(17)),
    DMA_Channel_SW6      = ((uint8_t)(18)),
    DMA_Channel_SW7      = ((uint8_t)(19)),
    DMA_Channel_SW8      = ((uint8_t)(20)),
    DMA_Channel_SW9      = ((uint8_t)(21)),
    DMA_Channel_SW10     = ((uint8_t)(22)),
    DMA_Channel_SW11     = ((uint8_t)(23)),
    DMA_Channel_SW12     = ((uint8_t)(24)),
    DMA_Channel_SW13     = ((uint8_t)(25)),
    DMA_Channel_SW14     = ((uint8_t)(26)),
    DMA_Channel_SW15     = ((uint8_t)(27)),
    DMA_Channel_SW16     = ((uint8_t)(28)),
    DMA_Channel_SW17     = ((uint8_t)(29)),
    DMA_Channel_SW18     = ((uint8_t)(30)),
    DMA_Channel_SW19     = ((uint8_t)(31)),
#elif defined (USE_MDR32F1QI)
/*-- req DMA request ---------------------------------------------------------*/
    DMA_Channel_REQ_UART1_TX = ((uint8_t)(0)),
    DMA_Channel_REQ_UART1_RX = ((uint8_t)(1)),
    DMA_Channel_REQ_UART2_TX = ((uint8_t)(2)),
    DMA_Channel_REQ_UART2_RX = ((uint8_t)(3)),
    DMA_Channel_REQ_SSP1_TX  = ((uint8_t)(4)),
    DMA_Channel_REQ_SSP1_RX  = ((uint8_t)(5)),
    DMA_Channel_REQ_SSP2_TX  = ((uint8_t)(6)),
    DMA_Channel_REQ_SSP2_RX  = ((uint8_t)(7)),
    DMA_Channel_REQ_SSP3_TX  = ((uint8_t)(8)),
    DMA_Channel_REQ_SSP3_RX  = ((uint8_t)(9)),
    DMA_Channel_REQ_TIM1     = ((uint8_t)(10)),
    DMA_Channel_REQ_TIM2     = ((uint8_t)(11)),
    DMA_Channel_REQ_TIM3     = ((uint8_t)(12)),
    DMA_Channel_REQ_TIM4     = ((uint8_t)(13)),
    DMA_Channel_SW1          = ((uint8_t)(14)),
    DMA_Channel_SW2          = ((uint8_t)(15)),
    DMA_Channel_SW3          = ((uint8_t)(16)),
    DMA_Channel_SW4          = ((uint8_t)(17)),
    DMA_Channel_SW5          = ((uint8_t)(18)),
    DMA_Channel_SW6          = ((uint8_t)(19)),
    DMA_Channel_SW7          = ((uint8_t)(20)),
    DMA_Channel_SW8          = ((uint8_t)(21)),
    DMA_Channel_SW9          = ((uint8_t)(22)),
    DMA_Channel_SW10         = ((uint8_t)(23)),
    DMA_Channel_SW11         = ((uint8_t)(24)),
    DMA_Channel_SW12         = ((uint8_t)(25)),
    DMA_Channel_SW13         = ((uint8_t)(26)),
    DMA_Channel_SW14         = ((uint8_t)(27)),
    DMA_Channel_SW15         = ((uint8_t)(28)),
    DMA_Channel_SW16         = ((uint8_t)(29)),
    DMA_Channel_SW17         = ((uint8_t)(30)),
    DMA_Channel_SW18         = ((uint8_t)(31)),
/*-- sreq DMA request --------------------------------------------------------*/
    DMA_Channel_SREQ_UART1_TX  = ((uint8_t)(0)),
    DMA_Channel_SREQ_UART1_RX  = ((uint8_t)(1)),
    DMA_Channel_SREQ_UART2_TX  = ((uint8_t)(2)),
    DMA_Channel_SREQ_UART2_RX  = ((uint8_t)(3)),
    DMA_Channel_SREQ_SSP1_TX   = ((uint8_t)(4)),
    DMA_Channel_SREQ_SSP1_RX   = ((uint8_t)(5)),
    DMA_Channel_SREQ_SSP2_TX   = ((uint8_t)(6)),
    DMA_Channel_SREQ_SSP2_RX   = ((uint8_t)(7)),
    DMA_Channel_SREQ_SSP3_TX   = ((uint8_t)(8)),
    DMA_Channel_SREQ_SSP3_RX   = ((uint8_t)(9)),
    DMA_Channel_SREQ_TIM1      = ((uint8_t)(10)),
    DMA_Channel_SREQ_TIM2      = ((uint8_t)(11)),
    DMA_Channel_SREQ_TIM3      = ((uint8_t)(12)),
    DMA_Channel_SREQ_TIM4      = ((uint8_t)(13)),
    DMA_Channel_SREQ_TIM1_REQ1 = ((uint8_t)(14)),
    DMA_Channel_SREQ_TIM1_REQ2 = ((uint8_t)(15)),
    DMA_Channel_SREQ_TIM1_REQ3 = ((uint8_t)(16)),
    DMA_Channel_SREQ_TIM1_REQ4 = ((uint8_t)(17)),
    DMA_Channel_SREQ_TIM2_REQ1 = ((uint8_t)(18)),
    DMA_Channel_SREQ_TIM2_REQ2 = ((uint8_t)(19)),
    DMA_Channel_SREQ_TIM2_REQ3 = ((uint8_t)(20)),
    DMA_Channel_SREQ_TIM2_REQ4 = ((uint8_t)(21)),
    DMA_Channel_SREQ_TIM3_REQ1 = ((uint8_t)(22)),
    DMA_Channel_SREQ_TIM3_REQ2 = ((uint8_t)(23)),
    DMA_Channel_SREQ_TIM3_REQ3 = ((uint8_t)(24)),
    DMA_Channel_SREQ_TIM3_REQ4 = ((uint8_t)(25)),
    DMA_Channel_SREQ_TIM4_REQ1 = ((uint8_t)(26)),
    DMA_Channel_SREQ_TIM4_REQ2 = ((uint8_t)(27)),
    DMA_Channel_SREQ_TIM4_REQ3 = ((uint8_t)(28)),
    DMA_Channel_SREQ_TIM4_REQ4 = ((uint8_t)(29)),
    DMA_Channel_SREQ_ADCDMA    = ((uint8_t)(30)),
    DMA_Channel_SREQ_SW1       = ((uint8_t)(31)),
#elif defined (USE_MDR32FG16S1QI)
/*-- req DMA request ---------------------------------------------------------*/
    DMA_Channel_REQ_UART1_TX  = ((uint8_t)(0)),
    DMA_Channel_REQ_UART1_RX  = ((uint8_t)(1)),
    DMA_Channel_REQ_UART2_TX  = ((uint8_t)(2)),
    DMA_Channel_REQ_UART2_RX  = ((uint8_t)(3)),
    DMA_Channel_REQ_SSP1_TX   = ((uint8_t)(4)),
    DMA_Channel_REQ_SSP1_RX   = ((uint8_t)(5)),
    DMA_Channel_REQ_SSP2_TX   = ((uint8_t)(6)),
    DMA_Channel_REQ_SSP2_RX   = ((uint8_t)(7)),
    DMA_Channel_REQ_DSP0      = ((uint8_t)(9)),
    DMA_Channel_REQ_DSP1      = ((uint8_t)(10)),
    DMA_Channel_REQ_DSP2      = ((uint8_t)(14)),
    DMA_Channel_REQ_DSP3      = ((uint8_t)(15)),
    DMA_Channel_REQ_SSP3_TX   = ((uint8_t)(16)),
    DMA_Channel_REQ_SSP3_RX   = ((uint8_t)(17)),
    DMA_Channel_REQ_SSP4_TX   = ((uint8_t)(18)),
    DMA_Channel_REQ_SSP4_RX   = ((uint8_t)(19)),
    DMA_Channel_REQ_UART3_TX  = ((uint8_t)(20)),
    DMA_Channel_REQ_UART3_RX  = ((uint8_t)(21)),
    DMA_Channel_REQ_AUC_ADC   = ((uint8_t)(22)),
    DMA_Channel_REQ_AUC_DAC   = ((uint8_t)(23)),
    DMA_Channel_REQ_CRYPTO    = ((uint8_t)(24)),
    DMA_Channel_REQ_DSP_TIM   = ((uint8_t)(25)),
    DMA_Channel_REQ_MCBSP1_TX = ((uint8_t)(26)),
    DMA_Channel_REQ_MCBSP1_RX = ((uint8_t)(27)),
    DMA_Channel_REQ_MCBSP2_TX = ((uint8_t)(28)),
    DMA_Channel_REQ_MCBSP2_RX = ((uint8_t)(29)),
    DMA_Channel_REQ_MCBSP3_TX = ((uint8_t)(30)),
    DMA_Channel_REQ_MCBSP3_RX = ((uint8_t)(31)),
/*-- sreq DMA request --------------------------------------------------------*/
    DMA_Channel_SREQ_UART1_TX  = ((uint8_t)(0)),
    DMA_Channel_SREQ_UART1_RX  = ((uint8_t)(1)),
    DMA_Channel_SREQ_UART2_TX  = ((uint8_t)(2)),
    DMA_Channel_SREQ_UART2_RX  = ((uint8_t)(3)),
    DMA_Channel_SREQ_SSP1_TX   = ((uint8_t)(4)),
    DMA_Channel_SREQ_SSP1_RX   = ((uint8_t)(5)),
    DMA_Channel_SREQ_SSP2_TX   = ((uint8_t)(6)),
    DMA_Channel_SREQ_SSP2_RX   = ((uint8_t)(7)),
    DMA_Channel_SREQ_ADC1      = ((uint8_t)(8)),
    DMA_Channel_SREQ_ADC2      = ((uint8_t)(9)),
    DMA_Channel_SREQ_TIM1      = ((uint8_t)(10)),
    DMA_Channel_SREQ_TIM2      = ((uint8_t)(11)),
    DMA_Channel_SREQ_TIM3      = ((uint8_t)(12)),
    DMA_Channel_SREQ_SDIO      = ((uint8_t)(13)),
    DMA_Channel_SREQ_DSP0      = ((uint8_t)(14)),
    DMA_Channel_SREQ_DSP1      = ((uint8_t)(15)),
    DMA_Channel_SREQ_SSP3_TX   = ((uint8_t)(16)),
    DMA_Channel_SREQ_SSP3_RX   = ((uint8_t)(17)),
    DMA_Channel_SREQ_SSP4_TX   = ((uint8_t)(18)),
    DMA_Channel_SREQ_SSP4_RX   = ((uint8_t)(19)),
    DMA_Channel_SREQ_UART3_TX  = ((uint8_t)(20)),
    DMA_Channel_SREQ_UART3_RX  = ((uint8_t)(21)),
    DMA_Channel_SREQ_DSP_TIM   = ((uint8_t)(25)),
    DMA_Channel_SREQ_MCBSP1_TX = ((uint8_t)(26)),
    DMA_Channel_SREQ_MCBSP1_RX = ((uint8_t)(27)),
    DMA_Channel_SREQ_MCBSP2_TX = ((uint8_t)(28)),
    DMA_Channel_SREQ_MCBSP2_RX = ((uint8_t)(29)),
    DMA_Channel_SREQ_MCBSP3_TX = ((uint8_t)(30)),
    DMA_Channel_SREQ_MCBSP3_RX = ((uint8_t)(31)),
#endif
} DMA_Valid_Channels;

#define IS_DMA_CHANNEL(CHANNEL) ((CHANNEL) <= (DMA_Channels_Number - 1))

/**
  * @brief DMA source incremented mode
  */
typedef enum
{
    DMA_SourceIncByte     = ((uint32_t)0x00),
    DMA_SourceIncHalfword = ((uint32_t)0x01),
    DMA_SourceIncWord     = ((uint32_t)0x02),
    DMA_SourceIncNo       = ((uint32_t)0x03)
} DMA_Src_Inc_Mode;

#define IS_DMA_SOURCE_INC_STATE(STATE)  (((STATE) == DMA_SourceIncByte)     || \
                                         ((STATE) == DMA_SourceIncHalfword) || \
                                         ((STATE) == DMA_SourceIncWord)     || \
                                         ((STATE) == DMA_SourceIncNo))

/**
  * @brief DMA destination incremented mode
  */
typedef enum
{
    DMA_DestIncByte     = ((uint32_t)0x00),
    DMA_DestIncHalfword = ((uint32_t)0x01),
    DMA_DestIncWord     = ((uint32_t)0x02),
    DMA_DestIncNo       = ((uint32_t)0x03)
} DMA_Dest_Inc_Mode;

#define IS_DMA_DEST_INC_STATE(STATE)  (((STATE)  == DMA_DestIncByte)     || \
                                       ((STATE)  == DMA_DestIncHalfword) || \
                                       ((STATE)  == DMA_DestIncWord)     || \
                                       ((STATE)  == DMA_DestIncNo))

/**
  * @brief DMA memory data size
  */
typedef enum
{
    DMA_MemoryDataSize_Byte     = ((uint32_t)(0x00 << 24)),
    DMA_MemoryDataSize_HalfWord = ((uint32_t)(0x11 << 24)),
    DMA_MemoryDataSize_Word     = ((uint32_t)(0x22 << 24))
} DMA_Mem_Data_Size;

#define IS_DMA_MEMORY_DATA_SIZE(SIZE)  (((SIZE) == DMA_MemoryDataSize_Byte)     || \
                                        ((SIZE) == DMA_MemoryDataSize_HalfWord) || \
                                        ((SIZE) == DMA_MemoryDataSize_Word))

/**
  * @brief DMA operating mode
  */
typedef enum
{
    DMA_Mode_Stop               = ((uint32_t)0x0),
    DMA_Mode_Basic              = ((uint32_t)0x1),
    DMA_Mode_AutoRequest        = ((uint32_t)0x2),
    DMA_Mode_PingPong           = ((uint32_t)0x3),
    DMA_Mode_MemScatterPri      = ((uint32_t)0x4),
    DMA_Mode_MemScatterAlt      = ((uint32_t)0x5),
    DMA_Mode_PerScatterPri      = ((uint32_t)0x6),
    DMA_Mode_PerScatterAlt      = ((uint32_t)0x7),
    DMA_Mode_PerScatterAltBurst = ((uint32_t)0xF)
} DMA_Operating_Mode;

#define IS_DMA_MODE(MODE)  (((MODE) == DMA_Mode_Stop)          || \
                            ((MODE) == DMA_Mode_Basic)         || \
                            ((MODE) == DMA_Mode_AutoRequest)   || \
                            ((MODE) == DMA_Mode_PingPong)      || \
                            ((MODE) == DMA_Mode_MemScatterPri) || \
                            ((MODE) == DMA_Mode_MemScatterAlt) || \
                            ((MODE) == DMA_Mode_PerScatterPri) || \
                            ((MODE) == DMA_Mode_PerScatterAlt) || \
                            ((MODE) == DMA_Mode_PerScatterAltBurst))

